TAL_INT_GIT/Sample Data/BY_WMS/Shipment_Confirmation/Input/Shipment_SOAP_Change/Shipment_SOAP_Change

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:sap-com:document:sap:soap:functions:mc-style">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:ZwmShipLoadOubIfd>
         <!--Optional:-->
         <Input>
            <!--Zero or more repetitions:-->
            <item>
               <SalesOrdNum>?</SalesOrdNum>
               <SalesOrdlin>?</SalesOrdlin>
               <PartNum>?</PartNum>
               <ShpQty>?</ShpQty>
               <Batch>?</Batch>
               <Plant>?</Plant>
               <StorageLoc>?</StorageLoc>
               <Rtcust>?</Rtcust>
               <Stcust>?</Stcust>
            </item>
			<item>
               <SalesOrdNum>?</SalesOrdNum>
               <SalesOrdlin>?</SalesOrdlin>
               <PartNum>?</PartNum>
               <ShpQty>?</ShpQty>
               <Batch>?</Batch>
               <Plant>?</Plant>
               <StorageLoc>?</StorageLoc>
               <Rtcust>?</Rtcust>
               <Stcust>?</Stcust>
            </item>
         </Input>
         <!--Optional:-->
         <Return>
            <!--Zero or more repetitions:-->
            <item>
               <Type>?</Type>
               <Id>?</Id>
               <Number>?</Number>
               <Message>?</Message>
               <LogNo>?</LogNo>
               <LogMsgNo>?</LogMsgNo>
               <MessageV1>?</MessageV1>
               <MessageV2>?</MessageV2>
               <MessageV3>?</MessageV3>
               <MessageV4>?</MessageV4>
               <Parameter>?</Parameter>
               <Row>?</Row>
               <Field>?</Field>
               <System>?</System>
            </item>
			<item>
               <Type>?</Type>
               <Id>?</Id>
               <Number>?</Number>
               <Message>?</Message>
               <LogNo>?</LogNo>
               <LogMsgNo>?</LogMsgNo>
               <MessageV1>?</MessageV1>
               <MessageV2>?</MessageV2>
               <MessageV3>?</MessageV3>
               <MessageV4>?</MessageV4>
               <Parameter>?</Parameter>
               <Row>?</Row>
               <Field>?</Field>
               <System>?</System>
            </item>
         </Return>
      </urn:ZwmShipLoadOubIfd>
   </soapenv:Body>
</soapenv:Envelope>